uxmal/reko/subjects/Microchip/C18/PIC18/PIC18Legacy.c
// PIC18Legacy.c
// Generated by decompiling PIC18Legacy.hex
// using Reko decompiler version 0.8.0.0.

#include "PIC18Legacy.h"

// 00000E: void fn00000E(Register Eq_2 FSR0, Register word32 TBLPTR)
void fn00000E(Eq_2 FSR0, word32 TBLPTR)
{
	__tblrd(TBLPTR, 0x01);
	0x00->b00C5 = TABLAT;
	__tblrd(TBLPTR, 0x01);
	0x00->b00C6 = TABLAT;
	byte TBLPTRL_24 = 0x06;
	byte TBLPTRH_25 = 0x00;
	byte TBLPTRU_26 = 0x00;
	Eq_26 Z_15 = cond(TABLAT);
	while (true)
	{
		if (!Z_15 && 0x00->b00C5 == 0x00)
			return;
		__tblrd(TBLPTR, 0x01);
		0x00->b00C0 = TABLAT;
		__tblrd(TBLPTR, 0x01);
		0x00->b00C1 = TABLAT;
		__tblrd(TBLPTR, 0x01);
		0x00->b00C2 = TABLAT;
		__tblrd(TBLPTR, 0x01);
		__tblrd(TBLPTR, 0x01);
		__tblrd(TBLPTR, 0x01);
		__tblrd(TBLPTR, 0x01);
		__tblrd(TBLPTR, 0x01);
		__tblrd(TBLPTR, 0x01);
		0x00->b00C3 = TABLAT;
		__tblrd(TBLPTR, 0x01);
		0x00->b00C4 = TABLAT;
		__tblrd(TBLPTR, 0x01);
		__tblrd(TBLPTR, 0x01);
		globals->b00C7 = TBLPTRL_24;
		globals->b00C8 = TBLPTRH_25;
		globals->b00C9 = TBLPTRU_26;
		0x00->b00C3 = 0x00->b00C3;
		Eq_96 Z_57 = cond(0x00->b00C3);
l000080:
		if (Z_57)
			break;
		0x00->b00C4 = 0x00->b00C4;
		if (0x00->b00C4 != 0x00)
			break;
		TBLPTRL_24 = globals->b00C7;
		TBLPTRH_25 = globals->b00C8;
		TBLPTRU_26 = globals->b00C9;
		0x00->b00C5 = 0x00->b00C5 - 0x01;
		0x00->b00C6 = 0x00->b00C6 - !cond(0x00->b00C5);
		Z_15 = cond(0x00->b00C6);
	}
	while (true)
	{
		__tblrd(TBLPTR, 0x01);
		*FSR0 = TABLAT;
		0x00->b00C3 = 0x00->b00C3 - 0x01;
		FSR0 = FSR0 + 0x01;
		Z_57 = cond(0x00->b00C3);
		if (0x00->b00C3 < 0x00)
			break;
		0x00->b00C4 = 0x00->b00C4 - 0x01;
	}
	goto l000080;
}

// 0000013A: void fn0000013A(Register Eq_2 FSR0, Register word32 TBLPTR)
void fn0000013A(Eq_2 FSR0, word32 TBLPTR)
{
	globals->b0001 = globals->b0001 & 191;
	Stack[fp + 0x01].ptr0000 = 330;
	fn00000E(FSR0, TBLPTR);
}

